[
  {
    "id": 1,
    "title": "VTB Solutions",
    "job": "Software Developer",
    "date": "April 2023 - Present",
    "description": "VTB Solutions is a consultancy firm specializing in low-code solutions, with a focus on developing and maintaining systems integrated with AI.",
    "activities": [
      "Developing new services and maintaining features using AspNet Core API/MVC, and managing data with MongoDB via the MongoDB Driver ORM.",
      "Creating front-end services with React JS, using React Router Dom, Tailwind CSS, and Hooks.",
      "Maintaining systems with Blazor WebAssembly, incorporating jQuery, and SignalR for messaging services.",
      "Integrating various services with Azure cloud services, and using Azure DevOps for deployment and management.",
      "Integrating OpenAI services into customers' existing systems for data analysis and providing suggestions through the creation of specialized agents, utilizing both OpenAI and Azure OpenAI platforms."
    ]
  },
  {
    "id": 2,
    "title": "Dokdex - solutions for the crypto environment",
    "job": "Software Developer",
    "date": "July 2022 - April 2023",
    "description": "Dokdex is a promising startup specializing in cryptocurrency solutions, made up of former PhD students and professionals with experience at Microsoft. The main thing is to support this emerging market.",
    "activities": [
      "Using Blazor Server to create a new cryptocurrency trading platform. MudBlazor was employed as a user interface framework and configuring a gateway to provide a solution for blockchain validation.",
      "I worked with SQL Server, using both Management Studio and Entity Framework Core to perform the mapping between our application and the database.",
      "Implementing responsive front-end interfaces with React JS and Bootstrap.",
      "Collaborating with a team of developers to design and implement new features."
    ]
  },
  {
    "id": 3,
    "title": "Jeep | Stellantis (Research & Development & Innovation)",
    "job": "Research and extension project",
    "date": "May 2022 - July 2022",
    "description": "Jeep is a renowned vehicle brand, recognized for its robustness, innovation and adventure. Jeep is part of Stellantis, one of the largest automotive groups in the world.",
    "activities": [
      "Using Python language, we worked on capturing, processing and training images, seeking to use the most modern CNN models as YOLO."
    ]
  }
]
